Repository: hfukuchi/SPDX_specification
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Purpose: An optional field for creators of the SPDX file to provide the version of the SPDX License List used when the SPDX file was created.
ja: 目的：SPDXファイルの作成者がSPDXファイルを作成する際に使用したSPDXライセンス リストのバージョンを任意で記載するフィールド。

source: Purpose: Compliance with the SPDX specification includes populating the SPDX fields therein with data related to such fields ("SPDX-Metadata").
ja: 目的：SPDX仕様に適合するには、SPDXフィールドに適当なデータ（"SPDX­Metadata"）の記入が必要である。

source: Purpose: Compliance with the SPDX specification includes populating the SPDX fields therein with data related to such fields ("SPDX?Metadata").
ja: 目的：SPDX仕様に適合するには、SPDXフィールドに適当なデータ（"SPDX­Metadata"）の記入が必要である。

source: Purpose: Identify any external SPDX documents referenced within this SPDX document.
ja: 目的：このSPDX文書内で参照されている外部SPDX文書を特定する。

source: Purpose: Identify name of this document as designated by creator.
ja: 目的：作成者によって付けられた文書名を特定する

source: Purpose: Identify the actual distribution source for the package/directory identified in the SPDX file.
ja: 目的：SPDXファイルで特定されたパッケージ／ディレクトリの実際の頒布元を特定する。

source: Purpose: Identify the current SPDX document which may be referenced in relationships by other files, packages internally and documents externally.
ja: 目的：内部の他のファイルやパッケージや外部の文書と関係づけられている現行のSPDX文書を特定する。

source: Purpose: Identify the full name of the package as given by Package Originator.
ja: 目的：Package Originator（パッケージ原作者）によって与えられたパッケージのフルネームを特定する。

source: Purpose: Identify the version of the
ja: 目的：パッケージのバージョンを特定する。

source: Purpose: Identify when the SPDX file was originally created.
ja: 目的：SPDXファイルがいつ作成されたかを特定する。

source: Purpose: If the package identified in the SPDX file originated from a different person or organization than identified as Package Supplier (see section 3.5 above), this field identifies from where or whom the package originally came.
ja: 目的：SPDXファイルで特定されるパッケージがPackage Supplier（パッケージ供給者）（3.5節参照）で記述されたのとは別の人や組織が原作者である場合、このフィールドはパッケージが誰があるいはどこで最初に作られたかを特定する。

source: Purpose: Indicates whether the file content of this package has been available for or subjected to analysis when creating the SPDX document.
ja: 目的：このパッケージのファイルが入手可能であるか、またはSPDX文書作成時に解析対象になっていたかを示す。

source: Purpose: Provide a reference number that can be used to understand how to parse and interpret the rest of the file.
ja: 目的：ファイルをパースして解釈する方法を理解するのに使用される参照番号を提供する。

source: Purpose: Provide an SPDX document specific namespace as a unique absolute Uniform Resource Identifier (URI) as specified in RFC-3986, with the exception of the ‘#’ delimiter.
ja: 目的：‘#’ デリミタを除いて、RFC-3986に規定されている固有な絶対ユニフォーム リソース識別子（URI）としてSPDX文書特有の名前空間を提供する。

source: Purpose: Provide an SPDX document specific namespace as a unique absolute Uniform Resource Identifier (URI) as specified in RFC?3986, with the exception of the ‘#’ delimiter.
ja: 目的：‘#’ デリミタを除いて、RFC-3986に規定されている固有な絶対ユニフォーム リソース識別子（URI）としてSPDX文書特有の名前空間を提供する。

source: Purpose: Provide the actual file name of the package, or path of the directory being treated as a package.
ja: 目的：実際のファイル名やパッケージとして扱われるディレクトリのパスを提供する。

source: Purpose: This field contains the license the SPDX file creator has concluded as governing the package or alternative values, if the governing license cannot be determined.
ja: 目的：このフィールドは、SPDXファイル作成者がパッケージに適用されると結論したライセンスを与える。ライセンスを決定できない場合には代替値を与える。

source: Purpose: This field is to contain a list of all licenses found in the package.
ja: 目的：このフィールドはパッケージ内で発見された全ライセンスのリストを含む。

source: Purpose: This field provides a place for the SPDX file creator to record a web site that serves as the package's home page.
ja: 目的：このフィールドは、SPDXファイル作成者にパッケージのホームページとしてウェブサイトを記録する場所を提供する。

source: Purpose: This field provides a place for the SPDX file creator to record any relevant background information or additional comments about the origin of the package.
ja: 目的：このフィールドは、SPDXファイル作成者に関連する背景情報やオリジナル パッケージに関する追加コメントを記録する場所を提供する。

source: Purpose: This field provides an independently reproducible mechanism identifying specific contents of a package based on the actual files (except the SPDX file itself, if it is included in the package) that make up each package and that correlates to the data in this SPDX file.
ja: 目的：このフィールドは、各パッケージを構成し、このSPDXファイル中のデータと関連する実際のファイル（SPDXファイルがパッケージに含まれている場合には、SPDXファイルは除く）を基にしたパッケージの特定コンテンツを指定する独立再現メカニズムを提供する。

source: Purpose: This field provides an independently reproducible mechanism that permits unique identification of a specific package that correlates to the data in this SPDX file.
ja: 目的：このフィールドは、このSPDXファイル中のデータと関連するパッケージを一意に特定できる独立再現メカニズムを提供する。

source: Purpose: Uniquely identify any element in an SPDX document which may be referenced by other elements.
ja: 目的：他の要素から参照されるSPDX文書内の各要素を一意に特定する。

source: Purpose: Compliance with the SPDX specification includes populating the SPDX fields therein with data related to such fields ("SPDX­Metadata").
ja: 目的：SPDX仕様に適合するには、SPDXフィールドに適当なデータ（"SPDX­Metadata"）の記入が必要である。

source: Purpose: Identify the current SPDX document which may be referenced in relationships by other files, packages internally and documents externally. To reference another SPDX document in total, this identifier should be used with the external document identifier preceding it.
ja: 目的：内部の他のファイルやパッケージや外部の文書と関係づけられている現行のSPDX文書を特定する。全体として他の文書を参照するため、この識別子は外部文書識別子と使われるべきである。

source: Purpose: Identify when the SPDX file was originally created. The date is to be specified according to combined date and time in UTC format as specified in ISO 8601 standard. This field is distinct from the fields in section 7, which involves the addition of information during a subsequent review.
ja: 目的：SPDXファイルがいつ作成されたかを特定する。作成日は、ISO8601標準のUTCフォーマットで記述された結合日時に従って特定される。このフィールドは、後続のレビューにおいて情報を追加できる、7節で定義のフィールドとは区別される。

source: Purpose: Provide an SPDX document specific namespace as a unique absolute Uniform Resource Identifier (URI) as specified in RFC­3986, with the exception of the ‘#’ delimiter.
ja: 目的：‘#’ デリミタを除いて、RFC-3986に規定されている固有な絶対ユニフォーム リソース識別子（URI）としてSPDX文書特有の名前空間を提供する。

source: Purpose: Uniquely identify any element in an SPDX document which may be referenced by other elements. These may be referenced internally and externally with the addition of the SPDX
ja: 目的：他の要素から参照されるSPDX文書内の各要素を一意に特定する。これらは、内部から参照され、SPDX文書識別子と組み合わせて外部からも参照される。

source: Purpose: Identify the actual distribution source for the package/directory identified in the SPDX file. This may or may not be different from the originating distribution source for the package.
ja: 目的：SPDXファイルで特定されたパッケージ／ディレクトリの実際の頒布元を特定する。これは、パッケージ原作者と同じ場合も異なる場合もありうる。

source: RDF: The URI for the element will follow the form: [SPDX DocumentNamespace]#[SPDX Identifier]
ja: RDF: 要素のURIは、以下のフォームに従う：[SPDX DocumentNamespace]#[SPDX Identifier]

source: Rather than use the artifactOf* attributes (Sections 4.9-4.11) to describe the relation of these files to their project, the outside project can be represented by another package, Package B, whose FilesAnalyzed attribute is set to “false”.
ja: これらのファイルとプロジェクトの関係を記述するのにartifactOf*属性（4.9­4.11節）を使うよりも、外部プロジェクトは他のパッケージPackage Bで表現できる。Package BのFile Analyzed属性は“false”にする。

source: Rather than use the artifactOf* attributes (Sections 4.9?4.11) to describe the relation of these files to their project, the outside project can be represented by another package, Package B, whose FilesAnalyzed attribute is set to “false”.
ja: これらのファイルとプロジェクトの関係を記述するのにartifactOf*属性（4.9­4.11節）を使うよりも、外部プロジェクトは他のパッケージPackage Bで表現できる。Package BのFile Analyzed属性は“false”にする。

source: Rationale
ja: 理論的根拠

source: Relationships Between SPDX Elements: Information on how Documents, Packages & Files relate to each other.
ja: Relationships Between SPDX Elements（SPDX要素間関連情報）：文書、パッケージおよびファイルの相互関連の情報

source: Resource Description Framework (RDF) can be used to represent this information, as can an annotated tag value flat text file.
ja: 注釈付きタグ値フラット テキスト ファイル（annotated tag value flat text file）と同様に、リソース記述フレームワーク（RDF）で情報を記述できなければならない

source: SPDX Document Creation Information: Meta data to associate analysis results with a specific version of the SPDX file and license for use, and provide information on how, when, and by whom the SPDX file was created.
ja: SPDX Document Creation Information（SPDX文書生成情報）：解析結果の表記に使われるSPDXファイルとライセンスリストの特定のバージョンおよび、誰が、いつ、どのようにSPDXファイルを作成したかに関するメタデータ

source: SPDX Document Namespace
ja: SPDX Document Namespace（SPDX文書名前空間）

source: SPDX Identifier
ja: SPDX Identifier（SPDX識別子）

source: SPDX Version
ja: SPDX Version（SPDXバージョン）

source: SPDX supported schemes are: hg+http, hg+https, hg+static-http and hg+ssh.
ja: SPDXサポート スキーム：hg+http, hg+https, hg+static­http および hg+ssh.

source: SPDX supported schemes are: hg+http, hg+https, hg+static­http and hg+ssh.
ja: SPDXサポート スキーム：hg+http, hg+https, hg+static­http および hg+ssh.

source: SPDX supports Bazaar using the bzr+http, bzr+https, bzr+ssh, bzr+sftp, bzr+ftp and bzr+lp schemes.
ja: SPDXは、bzr+http、bzr+https、bzr+ssh、bzr+sftp、bzr+ftpおよびbzr+lpスキームを使ってBazaarをサポートする。

source: SPDX supports git, git+git, git+https git+http and git+ssh transports.
ja: SPDXは、git、git+git、git+https git+httpおよびgit+ssh transportsをサポートする。

source: SPDX supports the URL schemes svn, svn+svn, svn+http, svn+https, svn+ssh.
ja: SPDXは、svn, svn+svn, svn+http, svn+https, svn+sshのURLスキームをサポートする。

source: See Appendix V: Using SPDX short identifiers in Source Files for more information.
ja: 詳細は、Appendix V：ソース ファイルでのSPDX簡易識別子の利用を参照。

source: See section 2.5 for the definition of the SPDX Document Namespace and section 2.3 for the definition of the SPDX Identifier
ja: SPDX Document Namespace（SPDX文書名前空間）の定義については2.5節を参照。SPDX Identifier（SPDX識別子）の定義については2.3節を参照。

source: See section 2.6 for a description on how external documents are referenced.
ja: 外部文書の参照方法については2.6節を参照。

source: See section 2.6 for a description on how external documents are referenced. Although it is not required, the URI can be constructed in a way which provides information on how the SPDX document can be found.
ja: 外部文書の参照方法については2.6節を参照。要求されていないが、SPDX文書を見つけるための情報を提供するようにURIを構成できる。

source: See section 5 Snippet Information for further details on the fields available to describe snippets.
ja: コード断片を記述するフィールドの詳細については、5 コード断片情報を参照。

source: See the “Relationships between SPDX Elements” section for examples.
ja: “Relationships between SPDX Elements”（「SPDX要素間の関係」）を参照。

source: See: section 3.21 External Reference, 3.22 External Reference Comment and Appendix VI: External Repository Identifiers for more information.
ja: 参照：3.21外部参照、3.22 外部参照コメント、詳細は、Appendix VI：外部リポジトリ識別子。

source: Should be easy to recognize in a file system without opening the file.
ja: ファイル システム上でファイルを開くことなく認識しやすくするべきである。

source: Should be easy to recognize in a file system without opening the file. A suggested naming convention is to use *.spdx (for tag­value format) and *­spdx.rdf for RDF format.
ja: ファイル システム上でファイルを開くことなく認識しやすくするべきである。推奨されるネーミング慣例は、*.spdx（タグ値フォーマット）と*­spdx.rdf（RDFフォーマット）である

source: Snippet Information: Facts that are specific to only a part of a file.
ja: Snippet Information（コード断片情報）：ファイルの一部分にだけ特有の事実

source: Snippets have been added to allow a portion of a file to be identified as having different properties from the file it resides in.
ja: ファイルの一部分がファイル（全体）と異なる属性を持てるように、コード断片（Snippets）が追加された。

source: Snippets have been added to allow a portion of a file to be identified as having different properties from the file it resides in. The use of snippets is completely optional and it is not manditory for snippets to be identified. See section 5 Snippet Information for further details on the fields available to describe snippets.
ja: ファイルの一部がファイルと異なる属性を持てるように、コード断片（Snippets）が追加された。コード断片の仕様は、完全に任意であり、コード断片を識別する必要はない。コード断片を記述するフィールドの詳細については、5 コード断片情報を参照

source: Software Package Data Exchange (SPDX®)
ja: ソフトウェア パッケージ データ交換（SPDX ® ）

source: Software Package Data Exchange (SPDX?)
ja: ソフトウェア パッケージ データ交換（SPDX ® ）

source: Software development teams across the globe use the same open source packages, but little infrastructure exists to facilitate collaboration on the analysis or share the results of these analysis activities.
ja: 世界中のソフトウェア開発チームが同一のオープン ソース パッケージを利用しますが、解析の共同作業や解析結果の共有を促進するインフラはほとんどない。

source: Software development teams across the globe use the same open source packages, but little infrastructure exists to facilitate collaboration on the analysis or share the results of these analysis activities. As a result, many groups are performing the same work leading to duplicated efforts and redundant information.
ja: 世界中のソフトウェア開発チームが同一のオープン ソース パッケージを利用しますが、解析の共同作業や解析結果の共有を促進するインフラはほとんどありません。その結果、多くのグループが、重複する努力と余分な情報を生み出す同じ作業を行っていることになります。

source: Some examples:
ja: いくつかの例：

source: Source Information
ja: Source Information（ソース情報）

source: Specification Version: 2.1
ja: 仕様バージョン：2.1

source: Specifying sub-paths, branch names, a commit hash, a revision or a tag name is recommended, and supported using the "@"delimiter for commits and the "#" delimiter for sub-paths.
ja: サブパス、ブランチ名、コミット ハッシュ、リビジョン、タグ名を指定することが推奨される。コミットには"@"デリミター、サブパスには"#" デリミターを使ってサポートしている。

source: Specifying sub?paths, branch names, a commit hash, a revision or a tag name is recommended, and supported using the "@"delimiter for commits and the "#" delimiter for sub?paths.
ja: サブパス、ブランチ名、コミット ハッシュ、リビジョン、タグ名を指定することが推奨される。コミットには"@"デリミター、サブパスには"#" デリミターを使ってサポートしている。

source: Specifying sub­paths, branch names, a commit hash, a revision or a tag name is recommended, and supported using the "@"delimiter for commits and the "#" delimiter for sub­paths.
ja: サブパス、ブランチ名、コミット ハッシュ、リビジョン、タグ名を指定することが推奨される。コミットには"@"デリミター、サブパスには"#" デリミターを使ってサポートしている。

source: Starting with SPDX 2.0, it is not necessary to have a package wrapping a set of files.
ja: SPDX 2.0を使う場合には、ファイルセットを包含するパッケージは必ずしも必要ではない。

source: Sub-paths and branch names or commit hash can be combined too:
ja: サブパス、ブランチ名、コミット ハッシュは結合できる：

source: Sub-paths and branch names or commit hash can be combined too: PackageDownloadLocation: hg+https://hg.myproject.org/MyProject@master#/src/MyClass.cpp
ja: サブパス、ブランチ名、コミット ハッシュは結合できる：PackageDownloadLocation: hg+https://hg.myproject.org/MyProject@master#/src/MyClass.cpp

source: Sub-paths and revisions can be combined too:
ja: サブパスとリビジョンは結合できる：

source: Sub?paths and branch names or commit hash can be combined too:
ja: サブパス、ブランチ名、コミット ハッシュは結合できる：

source: Sub?paths and branch names or commit hash can be combined too: PackageDownloadLocation: hg+https://hg.myproject.org/MyProject@master#/src/MyClass.cpp
ja: サブパス、ブランチ名、コミット ハッシュは結合できる：PackageDownloadLocation: hg+https://hg.myproject.org/MyProject@master#/src/MyClass.cpp

source: Subdirectory name is preceeded with a “./”, see http://www.ietf.org/rfc/rfc3986.txt for syntax.
ja: サブディレクトリ名は、“./”に続く。構文については、http://www.ietf.org/rfc/rfc3986.txtを参照。

source: Sub­packages should not be nested inside a Package Information section, but should be separate and should use a Relationship to clarify.
ja: サブパッケージをパッケージ情報セクション中で入れ子にするべきではない。分離するべきである。明確にするためにRelationshipを使うべきである。

source: Sub­paths and branch names or commit hash can be combined too:
ja: サブパス、ブランチ名、コミット ハッシュは結合できる：

source: Sub­paths and branch names or commit hash can be combined too: PackageDownloadLocation: hg+https://hg.myproject.org/MyProject@master#/src/MyClass.cpp
ja: サブパス、ブランチ名、コミット ハッシュは結合できる：PackageDownloadLocation: hg+https://hg.myproject.org/MyProject@master#/src/MyClass.cpp

source: Sub­paths and revisions can be combined too:
ja: サブパスとリビジョンは結合できる：

source: T is delimiter for time
ja: T は時間の境界指示子

source: TABLE
ja: 目次

source: TABLE OF CONTENTS
ja: 目次

source: Tags and RDF properties are case sensitive.
ja: タグとRDFの用例は、大文字小文字を区別する

source: The ExternalDocumentRef contains two
ja: ExternalDocumentRefは2つの

source: The ExternalDocumentRef contains two properties:
ja: ExternalDocumentRefは2つの属性を持つ。

source: The Relationships section then relates the SPDX documents and contained SPDX elements with appropriate semantics per the dependencies in the scope of Package A.
ja: Relationships（関係性）セクションは、SPDX文書や含まれるSPDX要素をパッケージAのスコープ内の依存関係ごとに適切な構文に関係づける。

source: The SHA-1 algorithm will be used to provide the checksum by default.
ja: SHA-1アルゴリズムが、チェックサム計算にデフォルトで使用される。

source: The SPDX Document URI cannot contain a URI "part" (e.g. the "#" character), since the ‘#’ is used in SPDX element URIs (packages, files, snippets, etc) to separate the document namespace from the element’s SPDX identifier..
ja: SPDX文書URIはURI "part"（例えば ‘#’）を持てない。というのも‘#’は、SPDX要素URI（パッケージ、ファイル、コード断片等）の中で文書名前空間をSPDX識別子から分離するために使われるからである。

source: The SPDX Document URI cannot contain a URI "part" (e.g. the "#" character), since the ‘#’ is used in SPDX element URIs (packages, files, snippets, etc) to separate the document namespace from the element’s SPDX identifier.. Additionally, a scheme (e.g. “https:”) is required.
ja: SPDX文書URIはURI "part"（例えば ‘#’）を持てない。というのも‘#’は、SPDX要素URI（パッケージ、ファイル、コード断片等）の中で文書名前空間をSPDX識別子から分離するために使われるからである。さらに、スキーム（例えば“https:”）が必要である。

source: The SPDX file character set must support UTF-8 encoding.
ja: SPDXファイルのキャラクター セットは、UTF-8エンコードをサポートしなければならない

source: The SPDX file character set must support UTF?8 encoding.
ja: SPDXファイルのキャラクター セットは、UTF-8エンコードをサポートしなければならない

source: The SPDX specification contains numerous fields where an SPDX document creator may provide relevant explanatory text in SPDX-Metadata.
ja: SPDX仕様は、SPDX作成者がSPDXメタデータに関連する説明文を記入する多数のフィールドを含んでいる。

source: The SPDX specification contains numerous fields where an SPDX document creator may provide relevant explanatory text in SPDX?Metadata.
ja: SPDX仕様は、SPDX作成者がSPDXメタデータに関連する説明文を記入する多数のフィールドを含んでいる。

source: The SPDX specification contains numerous fields where an SPDX document creator may provide relevant explanatory text in SPDX­Metadata.
ja: SPDX仕様は、SPDX作成者がSPDXメタデータに関連する説明文を記入する多数のフィールドを含んでいる。

source: The SPDX working group seeks to create a data exchange format so that information about software packages and related content may be collected and shared in a common format with the goal of saving time and improving data accuracy.
ja: SPDX作業グループは、データ交換フォーマットを作り出そうと務めている。その結果、時間の節約とデータの正確さ向上を目指して、ソフトウェア パッケージと関連物の情報が共通フォーマットで収集、共有されるだろう。

source: The Software Package Data Exchange (SPDX(R)) specification is a standard format for communicating the components, licenses, and copyrights associated with software packages.
ja: ソフトウェア パッケージ データ交換（SPDX ®）仕様は、ソフトウェア パッケージに関連するコンポーネント、ライセンスや著作権 を伝えるためのフォーマットである。

source: The Software Package Data Exchange (SPDX®) specification is a standard format for communicating the components, licenses, and copyrights associated with software packages. An SPDX file is associated with a particular software package or set of packages and contains information about it in the SPDX format.
ja: ソフトウェア パッケージ データ交換（SPDX ®）仕様は、ソフトウェア パッケージに関連するコンポーネント、ライセンスや著作権 を伝えるためのフォーマットです。SPDXファイルは、特定のソフトウェア パッケージやパッケージ セットに関連付けられており、SPDXフォーマットになった情報を保持しています。

source: The Software Package Data Exchange (SPDX?) specification is a standard format for communicating the components, licenses, and copyrights associated with software packages.
ja: ソフトウェア パッケージ データ交換（SPDX ®）仕様は、ソフトウェア パッケージに関連するコンポーネント、ライセンスや著作権 を伝えるためのフォーマットである。

source: The URI is only used to create a unique ID following the above conventions.
ja: URIは、上記の慣習に従うために、一意のIDを生成するために利用される。

source: The URI must be unique for the SPDX document including the specific version of the SPDX document.
ja: URIは、SPDX文書の特定バージョンを含むSPDX文書に一意の値でなければならない。

source: The UUID could be a version 4 random UUID which can be generated from the Online UUID Generator or a version 5 UUID generated from a sha1 checksum known to be unique for this specific SPDX document version.
ja: UUIDは、オンラインUUID生成器で生成されるバージョン4 乱数UUIDか、この特定のSPDX文書バージョンには一意であると知られているSHA1チェックサムから生成されるバージョン5 UUIDが利用可能である。

source: The convention in this specification is for the RDF examples to use rdf:about="..."
ja: この仕様での慣例としてRDFの例 rdf:about="..." は、

source: The convention in this specification is for the RDF examples to use rdf:about="..."to represent that a proper Universal Resource Indicator (URI) should be present.
ja: この仕様での慣例としてRDFの例 rdf:about="..." は、適切な統一資源指示子（URI）が提示されるべきであることを示す。

source: The date is to be specified according to combined date and time in UTC format as specified in ISO 8601 standard.
ja: 作成日は、ISO8601標準のUTCフォーマットで記述された結合日時に従って特定される。

source: The major field will be incremented when incompatible changes between versions are made (one or more sections are created, modified or deleted).
ja: メジャー フィールドは、バージョン間で後方非互換の変更（一つ以上の節の追加、変更、削除）がされたときに更新される。

source: The minor field will be incremented when backwards compatible changes are made.
ja: マイナー フィールドは、後方互換の変更がされたときに更新される。

source: The name of the Package Supplier must be an organization or recognized author and not a web site.
ja: Package Supplier（パッケージ提供者）の名前は、ウェブサイトではなく、組織か認識されている著者でなければならない。

source: The official copyright notice to be used with any non-verbatim reproduction and/or distribution of this SPDX Specification, including without limitation any partial use or combining this SPDX Specification with another work, is:
ja: このSPDX仕様の非逐語的な複製または頒布に使う公式な著作権表記は以下である。制限なしの部分的な利用やこのSPDX仕様を他の作品と結合する場合を含む：

source: The official copyright notice to be used with any non?verbatim reproduction and/or distribution of this SPDX Specification, including without limitation any partial use or combining this SPDX Specification with another work, is:
ja: このSPDX仕様の非逐語的な複製または頒布に使う公式な著作権表記は以下である。制限なしの部分的な利用やこのSPDX仕様を他の作品と結合する場合を含む：

source: The official copyright notice to be used with any non­verbatim reproduction and/or distribution of this SPDX Specification, including without limitation any partial use or combining this SPDX Specification with another work, is:
ja: このSPDX仕様の非逐語的な複製または頒布に使う公式な著作権表記は以下である。制限なしの部分的な利用やこのSPDX仕様を他の作品と結合する場合を含む：

source: The official copyright notice to be used with any verbatim reproduction and/or distribution of this SPDX Specification 2.1 is:
ja: このSPDX仕様2.1の逐語的な複製または頒布に使う公式な著作権表記は以下である：

source: The options to populate this field are limited to:
ja: このフィールドへの記入は以下に限られる：

source: The relationship between licenses (i.e., conjunctive, disjunctive) is not specified in this field - it is simply a listing of all licenses found.
ja: ライセンス間の関係（結合、分離）は、このフィールドでは記述されない。単に発見された全ライセンスのリストである。

source: The supported forms are:
ja: サポートしている形式：

source: The use of snippets is completely optional and it is not manditory for snippets to be identified.
ja: コード断片の仕様は、完全に任意であり、コード断片を識別する必要はない。

source: The version number consists of a major and minor version indicator.
ja: バージョン番号は、メジャー、マイナー バージョン指示子で構成される。

source: The “Artifact of Project” fields at the file level are now deprecated, as they can be replaced by a relationship to the more descriptive External Packages.
ja: ファイル レベルに置かれた「プロジェクト作成物」フィールドは、より記述的な外部パッケージへの関連で置き換えられるので、非推奨となっている。

source: The SPDX Document URI cannot contain a URI "part" (e.g. the "#" delimiter), since the "#" is used to uniquely identify SPDX element identifiers.
ja: SPDX文書URIはURI "part"（例えば ‘#’）を持てない。というのも‘#’は、SPDX要素識別子を特定するために使われるからである。

source: The SPDX file character set must support UTF­8 encoding.
ja: SPDXファイルのキャラクター セットは、UTF-8エンコードをサポートしなければならない

source: The URI must contain a scheme (e.g. “https:”).
ja: URIは、スキーム（例えば“https:”）を含まなければならない。

source: The convention in this specification is for the RDF examples to use rdf:about="..." to represent that a proper Universal Resource Indicator (URI) should be present.
ja: この仕様での慣例としてRDFの例 rdf:about="..." は、適切な統一資源指示子（URI）が提示されるべきであることを示す

source: Then, the relationship between Package A and Package
ja: パッケージAとパッケージBの関係は、

source: Then, the relationship between Package A and Package B can be documented as described in Section 6.
ja: Package AとPackage Bの関係は、6節で説明する方法で記述できる。

source: There can only be one URI for an SPDX document and only one SPDX document for a given URI.
ja: SPDX文書には1つのURIだけが対応し、与えられたURIには1つの文書だけが対応する。
